package com.sky.dto;

import lombok.Data;

/**
 * 不同状态的商品( 菜品/套餐 )数量统计对象, 用于封装 mapper 状态分组统计数据、传递给 service
 *
 * @CreateTime 2026/9/20 15:08
 */
@Data
public class GoodsStatusCount {
    // ==================== 常量 ====================


    // ==================== 静态变量 ====================


    // ==================== 实例变量 ====================
    /** 商品状态, {@link com.sky.constant} */
    private Integer status;

    /** 订单数量 */
    private Long count;


    // ==================== 构造器 ====================


    // ==================== 公有方法 ====================


    // ==================== 私有辅助方法 ====================

}
