package com.sky.projection.order;

import lombok.Data;

/**
 * 订单状态投影对象, 只查询订单状态、支付状态 2 个字段给 service 使用
 *
 * @CreateTime 2026/8/30 14:13
 */
@Data
public class OrderStatusProjection {
    // ==================== 常量 ====================


    // ==================== 静态变量 ====================


    // ==================== 实例变量 ====================
    /** 订单状态 */
    Integer status;
    /** 支付状态 */
    Integer payStatus;


    // ==================== 构造器 ====================


    // ==================== 公有方法 ====================


    // ==================== 私有辅助方法 ====================

}
