package com.sky.external;

import lombok.Data;

import java.util.ArrayList;
import java.util.List;

/**
 * 百度地图 2 点路线规划数据, 主要封装 2 点距离
 *
 * @CreateTime 2026/9/5 9:45
 */
@Data
public class DirectionDTO {
    // ==================== 常量 ====================


    // ==================== 静态变量 ====================


    // ==================== 实例变量 ====================
    /** 2 地址之间各种路线的距离 */
    private List< Double > distances = new ArrayList<>();


    // ==================== 构造器 ====================


    // ==================== 公有方法 ====================


    // ==================== 私有辅助方法 ====================

}
