package com.sky.utils;

/**
 * 字符串工具类, 抽取共用字符串操作逻辑
 *
 * @CreateTime 2026/10/3 14:38
 */
public class StringUtils {
    // ==================== 常量 ====================


    // ==================== 静态变量 ====================


    // ==================== 实例变量 ====================


    // ==================== 构造器 ====================
    private StringUtils(){}


    // ==================== 公有方法 ====================

    /**
     * 判断该字符串是否为空: null、空字符串、只有空字符
     *
     * @param string 字符串对象
     * @return true 该字符串为空, 否则 false
     */
    public static boolean isBlank( String string ){
        return string == null || string.isBlank();
    }


    // ==================== 私有辅助方法 ====================

}
